---
title: WireSizeSet
classe: Autodesk.Revit.DB.Electrical.WireSizeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# WireSizeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `wireSizeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `wireSizeSet.Size` | Int32 |
| `Void Clear()` | `wireSizeSet.Clear()` | Void |
| `Boolean Contains(WireSize)` | `wireSizeSet.Contains(item)` | Boolean |
| `Int32 Erase(WireSize)` | `wireSizeSet.Erase(item)` | Int32 |
| `WireSizeSetIterator ForwardIterator()` | `wireSizeSet.ForwardIterator()` | WireSizeSetIterator |
| `IEnumerator GetEnumerator()` | `wireSizeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(WireSize)` | `wireSizeSet.Insert(item)` | Boolean |
| `WireSizeSetIterator ReverseIterator()` | `wireSizeSet.ReverseIterator()` | WireSizeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```